DRAMCO/Dramco-UNO/avr/boards.txt
dramcouno.name=Dramco Uno

dramcouno.vid.0=0x2341
dramcouno.pid.0=0x0043
dramcouno.vid.1=0x2341
dramcouno.pid.1=0x0001
dramcouno.vid.2=0x2A03
dramcouno.pid.2=0x0043
dramcouno.vid.3=0x2341
dramcouno.pid.3=0x0243

dramcouno.upload.tool=arduino:avrdude
dramcouno.upload.protocol=arduino
dramcouno.upload.maximum_size=32256
dramcouno.upload.maximum_data_size=2048
dramcouno.upload.speed=115200

dramcouno.bootloader.tool=arduino:avrdude
dramcouno.bootloader.low_fuses=0xFF
dramcouno.bootloader.high_fuses=0xDE
dramcouno.bootloader.extended_fuses=0xFE
dramcouno.bootloader.unlock_bits=0x3F
dramcouno.bootloader.lock_bits=0x0F
dramcouno.bootloader.file=optiboot/optiboot/bootloaders/optiboot/optiboot_xplained328p.hex

dramcouno.build.mcu=atmega328p
dramcouno.build.f_cpu=16000000L
dramcouno.build.board=AVR_UNO
dramcouno.build.core=arduino:arduino
dramcouno.build.variant=dramco-uno

dramcouno.build.extra_flags=-DARDUINO_LMIC_PROJECT_CONFIG_H_SUPPRESS -DCFG_eu868=1 -DCFG_sx1276_radio=1 -DUSE_IDEETRON_AES -DDISABLE_BEACONS -DDISABLE_PING -DLMIC_ENABLE_long_messages=0 -DLMIC_ENABLE_DeviceTimeReq=0 -DDISABLE_LMIC_FAILURE_TO=1  
